
# fast__exponentiation
:toc:
:toclevels: 6
:stem:

## Fast Exponentiation Algorithm

### question

====
To implement stem:["power"(a,b)] :
given inputs stem:[a in RR] , stem:[b in NN] ;
initialize registers stem:[x] , stem:[y] , stem:[z] to
stem:[a] , stem:[1] , stem:[b] respectively ; and
repeat the following sequence of steps until termination :

1. if stem:[z = 0] return stem:[y] and terminate
2. stem:[r larr "remainder"(z,2)]
3. stem:[z larr "quotient"(z,2)]
4. if stem:[r = 1] then stem:[y larr xy]
5. stem:[x larr x^2]
====


###### ./src/parts/power.js
```

function power(a,b)
{
	let x = a ;
	let y = 1 ;
	let z = b ;

	while (true)
	{
		if (z == 0)
			return y ;

		r = remainder(z,2) ;
		
		z = quotient(z,2) ;

		if (r == 1)
			y = x * y ;
		
		x = x * x ;
	}
}

function remainder(a,b)
{
	return a % b ;
}

function quotient(a,b)
{
	return Math.floor(a / b) ;
}

```

```
$ node -i -e "$(< src/parts/power.js)"

> power(2,3) ;
8
> power(3,3) ;
27
> power(3,4) ;
81
> power(3.5,4) ;
150.0625
>
```

```
> power(3,4.5) ;
81
> // WRONG answer !
> Math.pow(3,4.5) ;
140.29611541307906
>
```

###### ./src/parts/power.prolog
```

%!  power(A0,B0,Q)
%
% Q is the calculation of the base A0 raised to the power B0 .

power(A0,B0,Q)
:-
power(A0,1,B0,Q)
.

power(_X0,Y0,Z0,Q)
:-
Z0 = 0 ,
Q = Y0
.

power(X0,Y0,Z0,Q)
:-
Z0 = 0 ,
remainder(Z0,2,R) ,
quotient(Z0,2,Z) ,
rxy_determines_y(R,X0,Y0,Y) ,
x_is_squared(X0,X) ,
power(X,Y,Z,Q)
.

x_is_squared(X0,X)
:-
X is X0 * X0
.

rxy_determines_y(R,X0,Y0,Y)
:-
R = 1 ,
Y is X0 * Y0
.

rxy_determines_y(R,_X0,Y0,Y)
:-
R = 1 ,
Y is Y0
.

remainder(A0,B0,Q)
:-
Q is mod(A0,B0)
.

quotient(A0,B0,Q)
:-
Q is floor(A0 / B0)
.

```

```
$ swipl -q -l src/parts/power.prolog

?- power(2,3,Q).
Q = 8 ;
false.

?- power(3,3,Q).
Q = 27 ;
false.

?- power(3,4,Q).
Q = 81 ;
false.

?- power(3.5,4,Q).
Q = 150.0625 ;
false.

?-
```

```
?- power(3,4.5,Q).
ERROR: Type error: `integer' expected, found `4.5' (a float)

?-
```
